### **머신러닝 분류 실습**

In [148]:
import pandas as pd

In [149]:
test = pd.read_csv('test.csv')
train = pd.read_csv('train.csv')

각 데이터의 행, 열 개수 파악하기

In [150]:
print(train.shape)
print(test.shape)

(29304, 16)
(3257, 15)

각 데이터의 정보 파악하기
- 자료형 파악 -> `object`일 경우에는 전처리 필요

In [151]:
print(train.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29304 entries, 0 to 29303
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              29304 non-null  int64
 1   age             29292 non-null  float64
 2   workclass       27642 non-null  object
 3   fnlwgt          29304 non-null  int64
 4   education       29304 non-null  object
 5   education.num   29304 non-null  int64
 6   marital.status  29304 non-null  object
 7   occupation      27636 non-null  object
 8   relationship    29304 non-null  object
 9   race            29304 non-null  object
 10  sex             29304 non-null  object
 11  capital.gain    29304 non-null  int64
 12  capital.loss    29304 non-null  int64
 13  hours.per.week  29291 non-null  float64
 14  native.country  28767 non-null  object
 15  income          29304 non-null  object
dtypes: float64(2), int64(5), object(9)
memory usage: 3.6+ MB
None

In [152]:
print(test.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3257 entries, 0 to 3256
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              3257 non-null   int64
 1   age             3251 non-null   float64
 2   workclass       3083 non-null   object
 3   fnlwgt          3257 non-null   int64
 4   education       3257 non-null   object
 5   education.num   3257 non-null   int64
 6   marital.status  3257 non-null   object
 7   occupation      3082 non-null   object
 8   relationship    3257 non-null   object
 9   race            3257 non-null   object
 10  sex             3257 non-null   object
 11  capital.gain    3257 non-null   int64
 12  capital.loss    3257 non-null   int64
 13  hours.per.week  3248 non-null   float64
 14  native.country  3211 non-null   object
dtypes: float64(2), int64(5), object(8)
memory usage: 381.8+ KB
None

결측치 파악하기
- 결측치가 있다면 전처리 필요 (최대/최소/최빈/0 ..)

In [153]:
train.isnull().sum()

id                   0
age                 12
workclass         1662
fnlwgt               0
education            0
education.num        0
marital.status       0
occupation        1668
relationship         0
race                 0
sex                  0
capital.gain         0
capital.loss         0
hours.per.week      13
native.country     537
income               0
dtype: int64

In [154]:
test.isnull().sum()

id                  0
age                 6
workclass         174
fnlwgt              0
education           0
education.num       0
marital.status      0
occupation        175
relationship        0
race                0
sex                 0
capital.gain        0
capital.loss        0
hours.per.week      9
native.country     46
dtype: int64

결측치 삭제 후 행, 열 개수 파악

In [155]:
# train = train.dropna()
# print(train.shape)

결측치 채우기 (범주형)
- 주로 최빈값으로 대체
- train에서 결측치 대체한 컬럼은 test에서도 동일하게 적용해야함

In [156]:
train['workclass'] = train['workclass'].fillna(train['workclass'].mode()[0])
train['native.country'] = train['native.country'].fillna(train['native.country'].mode()[0])
train['occupation'] = train['occupation'].fillna(train['occupation'].mode()[0])

test['workclass'] = test['workclass'].fillna(test['workclass'].mode()[0])
test['native.country'] = test['native.country'].fillna(test['native.country'].mode()[0])
test['occupation'] = test['occupation'].fillna(test['occupation'].mode()[0])

In [157]:
train.isnull().sum()

id                 0
age               12
workclass          0
fnlwgt             0
education          0
education.num      0
marital.status     0
occupation         0
relationship       0
race               0
sex                0
capital.gain       0
capital.loss       0
hours.per.week    13
native.country     0
income             0
dtype: int64

In [158]:
train['age'] = train['age'].fillna(train['age'].mean())
train['hours.per.week'] = train['hours.per.week'].fillna(train['hours.per.week'].median())

test['age'] = test['age'].fillna(test['age'].mean())
test['hours.per.week'] = test['hours.per.week'].fillna(test['hours.per.week'].median())

In [159]:
train.isnull().sum() # 결측치 다 채워졌는지 확인

id                0
age               0
workclass         0
fnlwgt            0
education         0
education.num     0
marital.status    0
occupation        0
relationship      0
race              0
sex               0
capital.gain      0
capital.loss      0
hours.per.week    0
native.country    0
income            0
dtype: int64

In [160]:
test.isnull().sum()

id                0
age               0
workclass         0
fnlwgt            0
education         0
education.num     0
marital.status    0
occupation        0
relationship      0
race              0
sex               0
capital.gain      0
capital.loss      0
hours.per.week    0
native.country    0
dtype: int64

이상치 처리
- `describe()`로 확인
- age가 음수인 값이 있으므로 제거해야 함.
- test에는 age가 음수인 값이 없음.
- 항상 중간중간마다 `print(df.shape)`를 통해 확인하기.

In [161]:
train.describe()

,id,age,fnlwgt,education.num,capital.gain,capital.loss,hours.per.week
count,29304.000000,29304.000000,2.930400e+04,29304.000000,29304.000000,29304.000000,29304.000000
mean,16264.027880,38.553223,1.897488e+05,10.080842,1093.858722,86.744506,40.434036
std,9384.518323,13.626020,1.055250e+05,2.570824,7477.435640,401.518928,12.321306
min,0.000000,-38.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,8145.750000,28.000000,1.177890e+05,9.000000,0.000000,0.000000,40.000000
50%,16253.500000,37.000000,1.783765e+05,10.000000,0.000000,0.000000,40.000000
75%,24374.250000,48.000000,2.370682e+05,12.000000,0.000000,0.000000,45.000000
max,32560.000000,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [162]:
test.describe()

,id,age,fnlwgt,education.num,capital.gain,capital.loss,hours.per.week
count,3257.000000,3257.000000,3.257000e+03,3257.000000,3257.000000,3257.000000,3257.000000
mean,16423.704943,38.802830,1.900447e+05,10.079214,931.804728,92.336199,40.466994
std,9535.416746,13.904759,1.057902e+05,2.590118,6496.962999,415.732721,12.581146
min,3.000000,17.000000,1.882700e+04,1.000000,0.000000,0.000000,1.000000
25%,8078.000000,28.000000,1.186520e+05,9.000000,0.000000,0.000000,40.000000
50%,16626.000000,37.000000,1.783190e+05,10.000000,0.000000,0.000000,40.000000
75%,24743.000000,48.000000,2.364360e+05,12.000000,0.000000,0.000000,45.000000
max,32559.000000,90.000000,1.033222e+06,16.000000,99999.000000,3900.000000,99.000000

In [163]:
print(train.shape)
train = train[train['age'] > 0]
print(train.shape)

(29304, 16)
(29301, 16)

### **인코딩**



**원-핫 인코딩**
- 범주형 데이터를 수치형 데이터로 변환하는 과정
- 원-핫 인코딩 후 train과 test의 컬럼 개수가 불일치하므로 데이터 합치는 작업 필요.

In [164]:
y_train = train.pop("income")
# pop()은 income 컬럼을 y_train에 대입하고, income 컬럼을 삭제하는 작업 동시 수행

In [165]:
# 원-핫 인코딩
train_oh = pd.get_dummies(train).copy()
test_oh = pd.get_dummies(test).copy()
print(train.shape, train_oh.shape, test.shape, test_oh.shape)

(29301, 15) (29301, 106) (3257, 15) (3257, 102)

컬럼 개수가 불일치하므로 데이터 병합을 통해 개수 일치시키는 작업

In [166]:
print(train.shape, test.shape)
data = pd.concat([train, test], axis=0) # train과 test 위아래로 병합
data_oh = pd.get_dummies(data)

train_oh = data_oh.iloc[:len(train)].copy() # train 부분
test_oh = data_oh.iloc[len(train):].copy() # test 부분
print(train_oh.shape, test_oh.shape)

(29301, 15) (3257, 15)
(29301, 106) (3257, 106)

**레이블 인코딩**

In [167]:
from sklearn.preprocessing import LabelEncoder

cols = train.select_dtypes(include='object').columns

for col in cols :
    le = LabelEncoder()
    train[col] = le.fit_transform(train[col])
    test[col] = le.transform(test[col])

train.head()

,id,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country
0,3331,34.0,6,177331,15,10,2,9,0,2,1,4386,0,40.0,38
1,19749,58.0,3,290661,11,9,2,2,0,4,1,0,0,40.0,38
2,1157,48.0,3,125933,15,10,6,3,4,2,0,0,1669,38.0,38
3,693,58.0,3,100313,15,10,2,10,0,4,1,0,1902,40.0,38
4,12522,41.0,3,195661,15,10,2,13,0,4,1,0,0,54.0,38

### **스케일링**


Min-Max Scaling : 데이터를 0과 1 사이로 변환

In [168]:
def get_df() :
    train_copy = train.copy()
    test_copy = test.copy()
    return train_copy, test_copy

In [171]:
train_copy, test_copy = get_df()
cols = ['age','fnlwgt','education.num','capital.gain','capital.loss','hours.per.week']

from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()
train_copy[cols] = scaler.fit_transform(train_copy[cols])
test_copy[cols] = scaler.transform(test_copy[cols])

train_copy[cols].head()

,age,fnlwgt,education.num,capital.gain,capital.loss,hours.per.week
0,0.232877,0.112092,0.600000,0.04386,0.000000,0.397959
1,0.561644,0.189060,0.533333,0.00000,0.000000,0.397959
2,0.424658,0.077184,0.600000,0.00000,0.383150,0.377551
3,0.561644,0.059785,0.600000,0.00000,0.436639,0.397959
4,0.328767,0.124541,0.600000,0.00000,0.000000,0.540816

In [172]:
train_copy.info()

<class 'pandas.core.frame.DataFrame'>
Index: 29301 entries, 0 to 29303
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              29301 non-null  int64
 1   age             29301 non-null  float64
 2   workclass       29301 non-null  int32
 3   fnlwgt          29301 non-null  float64
 4   education       29301 non-null  int32
 5   education.num   29301 non-null  float64
 6   marital.status  29301 non-null  int32
 7   occupation      29301 non-null  int32
 8   relationship    29301 non-null  int32
 9   race            29301 non-null  int32
 10  sex             29301 non-null  int32
 11  capital.gain    29301 non-null  float64
 12  capital.loss    29301 non-null  float64
 13  hours.per.week  29301 non-null  float64
 14  native.country  29301 non-null  int32
dtypes: float64(6), int32(8), int64(1)
memory usage: 2.7 MB